Store/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/Товары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает остатки указанной номенклатуры по списку складов.
//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатура для которой получаются остатки
//   МестаХранения - Массив из Строка - список складов для фильтрации остатков
//
// Возвращаемое значение:
//   Соответствие Из Строка - соответствие, где ключ - склад, значение - остаток товара
Функция ПолучитьОстатокПоСкладам(Номенклатура, МестаХранения) Экспорт
	
	ОстатокПоСкладам = Новый Соответствие;
	
	// Проверяем, что передан массив или список складов
	Если ТипЗнч(МестаХранения) <> Тип("Массив") И НЕ МестаХранения.Количество() > 0 Тогда
		Возврат ОстатокПоСкладам;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОстатки.Склад КАК Склад,
		|	СУММА(ТоварыОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.Товары.Остатки(, Номенклатура = &Номенклатура И Склад В (&СписокСкладов)) КАК ТоварыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОстатки.Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СписокСкладов", МестаХранения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОстатокПоСкладам.Вставить(Выборка.Склад, Выборка.Количество);
	КонецЦикла;
	
	Возврат ОстатокПоСкладам;
	
КонецФункции

// Файл: Store/src/AccumulationRegisters/Товары/ManagerModule.bsl
Сообщить(НСтр("ru='Привет, мир!'; en='Hello, world!'; zh='你好，世界！'; ar='مرحبا بالعالم!'"));


#КонецОбласти

#КонецЕсли
